---
kind: method
id: M:Autodesk.Revit.UI.Selection.Selection.GetReferences
source: html/4d55d8e8-20fd-e19f-060b-0f5a439f71f5.htm
---
# Autodesk.Revit.UI.Selection.Selection.GetReferences Method

Returns the references that are currently selected.

## Syntax (C#)
```csharp
public IList<Reference> GetReferences()
```

## Returns
The collection containing the selected references.

## Remarks
The references can be an element or subelement in the host or a linked document.